src/Documents/mega_ЗаказПокупателя_FBS_OZON/mega_ЗаказПокупателя_FBS_OZON.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>mega_ЗаказПокупателя_FBS_OZON</name>
  <registerRecords>AccumulationRegister.mega_ВыработкаСотрудников_OZON</registerRecords>
  <attributes>
    <name>ЛичныйКабинет</name>
    <type>
      <types>CatalogRef.mega_ЛичныеКабинеты_OZON</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоСборки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеСборки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СборкаОкончена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяСборки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Запасы</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.mega_Номенклатура_OZON</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерВходящегоДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПечати</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/mega_ЗаказПокупателя_FBS_OZON/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область ОбработчикиСобытий

// Код процедур и функций

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти

#Область ИнтерфейсПечати


Функция СформироватьПечатнуюФормуСтикера(ДанныеПачати)Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.mega_ЗаказПокупателя_FBS_OZON.ПФ_MXL_Стикер");
	ОбластьМакета = Макет.ПолучитьОбласть("Строка|Столбец");
	
	Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
	
	//ПараметрыШтрихкода = Новый Структура;
	//ПараметрыШтрихкода.Вставить("Ширина",           Окр(ОбластьМакета.Рисунки.Заказ.Ширина / КоличествоМиллиметровВПикселе));
	//ПараметрыШтрихкода.Вставить("Высота",           Окр(ОбластьМакета.Рисунки.Заказ.Высота / КоличествоМиллиметровВПикселе));
	//ПараметрыШтрихкода.Вставить("Штрихкод",         СокрЛП(ДанныеПачати.НомерВходящегоДокумента));
	//ПараметрыШтрихкода.Вставить("ТипВходныхДанных", 0); // Штрихкод - это строка
	//ПараметрыШтрихкода.Вставить("ТипКода",          3); // Code39
	//ПараметрыШтрихкода.Вставить("ОтображатьТекст",  Ложь);
	//ПараметрыШтрихкода.Вставить("РазмерШрифта",     6);
	//
	//ОбластьМакета.Рисунки.Заказ.Картинка 	= МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
	
	ОбластьМакета.Параметры.НомерВходящегоДокумента 	= СокрЛП(ДанныеПачати.НомерВходящегоДокумента);
	ОбластьМакета.Параметры.Артикул 				= СокрЛП(ДанныеПачати.Номенклатура.Артикул);
	ОбластьМакета.Параметры.Наименование 			= СокрЛП(ДанныеПачати.Номенклатура.НаименованиеПолное);
	ОбластьМакета.Параметры.ДатаВремя				= ТекущаяДатаСеанса();
	ОбластьМакета.Параметры.Компьютер				= ИмяКомпьютера();
	ОбластьМакета.Параметры.Пользователь			= Строка(Пользователи.ТекущийПользователь());
	
	
	ПараметрыШтрихкода = Новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина",           Окр(ОбластьМакета.Рисунки.Штрихкод.Ширина / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Высота",           Окр(ОбластьМакета.Рисунки.Штрихкод.Высота / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Штрихкод",         СокрЛП(ДанныеПачати.Номенклатура.Идентификатор));
	ПараметрыШтрихкода.Вставить("ТипВходныхДанных", 0); // Штрихкод - это строка
	ПараметрыШтрихкода.Вставить("ТипКода",          1); // EAN13
	ПараметрыШтрихкода.Вставить("ОтображатьТекст",  Истина);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",     6);
	
	ОбластьМакета.Рисунки.Штрихкод.Картинка = МенеджерОборудованияВызовСервера.ПолучитьКартинкуШтрихкода(ПараметрыШтрихкода);
	
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	Возврат ТабличныйДокумент
	
КонецФункции

Функция СформироватьПечатнуюФормуСтикеры(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_mega_ЗаказПокупателя_FBS_OZON_Стикер";
	ПервыйДокумент = Истина;
	
	Для Каждого ЗаказПокупателя Из МассивОбъектов Цикл 
		Для Каждого Стикер Из ЗаказПокупателя.Запасы Цикл 
			
			
			
			Если Не ПервыйДокумент Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			ПервыйДокумент    = Ложь;
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			
			ДанныеПачати = Новый Структура("Номенклатура,НомерВходящегоДокумента");
			ЗаполнитьЗначенияСвойств(ДанныеПачати, Стикер);
			ТабличныйДокумент.Вывести(СформироватьПечатнуюФормуСтикера(ДанныеПачати));
			
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Стикер);		
		КонецЦикла;
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;

	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;

КонецФункции

Функция СформироватьПечатнуюФормуСтикераПоДаннымОзон(Штрихкод, СКЮ, Наименование)Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.mega_ЗаказПокупателя_FBS_OZON.ПФ_MXL_СтикерПоДаннымОзон");
	ОбластьМакета = Макет.ПолучитьОбласть("Строка|Столбец");
	
	Эталон = Обработки.ПечатьЭтикетокИЦенников.ПолучитьМакет("Эталон");
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100;
			
	ПараметрыШтрихкода = ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
	ПараметрыШтрихкода.Вставить("Ширина",           Окр(ОбластьМакета.Рисунки.Штрихкод.Ширина / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Высота",           Окр(ОбластьМакета.Рисунки.Штрихкод.Высота / КоличествоМиллиметровВПикселе));
	ПараметрыШтрихкода.Вставить("Штрихкод",         Штрихкод);
	ПараметрыШтрихкода.Вставить("ТипВходныхДанных", 0); // Штрихкод - это строка
	ПараметрыШтрихкода.Вставить("ТипКода",          16); // EAN13
	ПараметрыШтрихкода.Вставить("ОтображатьТекст",  Истина);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",     6);  
	
	Результат = ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШтрихкода);
	ОбластьМакета.Рисунки.Штрихкод.Картинка = Результат.Картинка;
	ОбластьМакета.Параметры.Наименование = Наименование;
	
	
	ТабличныйДокумент.Вывести(ОбластьМакета);
	Возврат ТабличныйДокумент
	
КонецФункции

Функция СформироватьПечатнуюФормуСтикерыЛокализация(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)
	
	УстановитьПривилегированныйРежим(Истина);
	
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_mega_ЗаказПокупателя_FBS_OZON_СтикерПоДаннымОзон";
	ПервыйДокумент = Истина;
	
	Для Каждого ЗаказПокупателя Из МассивОбъектов Цикл 
		Для Каждого Стикер Из ЗаказПокупателя.Запасы Цикл 
			
			Штрихкоды = Справочники.mega_ЛичныеКабинеты_OZON.ПолучитьШтрикодыЗаказа(
				Стикер.НомерВходящегоДокумента, ЗаказПокупателя.ЛичныйКабинет);
			//Штрихкоды = Обработки.mega_ПечатьСтикеровAPIOzon.Создать().ПолучитьШтрикодыЗаказа(Стикер.НомерВходящегоДокумента);
			//Штрихкоды = СформироватьПечатнуюФормуСтикеровПоДаннымОзон(ШтрихкодыЗаказа);
			Для Каждого Штрихкод Из Штрихкоды Цикл
				
				
				Если Не ПервыйДокумент Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				
				ПервыйДокумент    = Ложь;
				НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
				
				ТабличныйДокумент.Вывести(СформироватьПечатнуюФормуСтикераПоДаннымОзон(
					Штрихкод["barcode"], Формат(Штрихкод["sku"], "ЧЦ=15; ЧДЦ=0; ЧРГ=' '; ЧГ=0"), Штрихкод["name"]));
				
				//УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Стикер);		
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;

	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;

КонецФункции

Функция СформироватьПечатнуюФормуСтикеровПоДаннымОзон(Штрихкоды)Экспорт	
	УстановитьПривилегированныйРежим(Истина);
		
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_mega_ЗаказПокупателя_FBS_OZON_СтикерПоДаннымОзон";
	ПервыйДокумент = Истина;
	
	Для Каждого Штрихкод Из Штрихкоды Цикл 
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент    = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		
		ТабличныйДокумент.Вывести(СформироватьПечатнуюФормуСтикераПоДаннымОзон(Штрихкод["barcode"], Формат(Штрихкод["sku"], "ЧЦ=15; ЧДЦ=0; ЧРГ=' '; ЧГ=0"), Штрихкод["name"]));
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;

	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ТабличныйДокумент;
КонецФункции



// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов.
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Стикер") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Стикер",
			НСтр("ru = 'Стикер'"),
			СформироватьПечатнуюФормуСтикеры(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),
			,
			"Документ.mega_ЗаказПокупателя_FBS_OZON.ПФ_MXL_Стикер");
	КонецЕсли;
		
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "СтикерПоДаннымОзон") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"СтикерПоДаннымОзон",
			НСтр("ru = 'Стикер (по данным озон)'"),
			СформироватьПечатнуюФормуСтикерыЛокализация(МассивОбъектов, ОбъектыПечати, ПараметрыПечати),
			,
			"Документ.mega_ЗаказПокупателя_FBS_OZON.ПФ_MXL_СтикерПоДаннымОзон");
	КонецЕсли;
			
	// параметры отправки печатных форм по электронной почте
	ЭлектроннаяПочтаУНФ.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов, 
		КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
		// Расходная накладная
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Стикер";
	КомандаПечати.Представление = НСтр("ru = 'Стикер'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 10;
	
	
	// Расходная накладная
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "СтикерПоДаннымОзон";
	КомандаПечати.Представление = НСтр("ru = 'Стикер (по данным озон)'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
	КомандаПечати.Порядок = 11;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
